---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainGeneralProblem
source: html/ba4d6919-3156-fe06-fbdb-1b044e4202f1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainGeneralProblem Property

The chain formed by these curve elements cannot be processed and will be ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainGeneralProblem { get; }
```